БухЭксп/Documents/CW_ПрайсКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ПрайсКонтрагента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_ПрайсыКонтрагентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрайса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПрайсовКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействителенПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПрайса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_ПрайсКонтрагента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ---------------------------------------------------------------------------- 
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	Если (ЗначениеЗаполнено(ЗначениеКопирования)) Тогда
		АдресПрайса = ПоместитьВоВременноеХранилище(ЗначениеКопирования.ХранилищеПрайса.Получить(),ЭтаФорма.УникальныйИдентификатор);
	Иначе
		АдресПрайса = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("Объект").ХранилищеПрайса.Получить(),ЭтаФорма.УникальныйИдентификатор);	
		Если (Объект.Ссылка.Пустая()) Тогда
			Объект.ВидКонтрагента = Перечисления.CW_ВидыКонтрагентов.Поставщик;	
		КонецЕсли; 
	КонецЕсли; 
	
	_СформироватьЗаголовок();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

// --- 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (ЭтоАдресВременногоХранилища(АдресПрайса)) Тогда
		Нечто = ПолучитьИзВременногоХранилища(АдресПрайса);
		ТекущийОбъект.ХранилищеПрайса = Новый ХранилищеЗначения(Нечто);
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТипПрайсаПриИзменении(Элемент)
	АдресПрайса = "";
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РедактироватьПрайс(Команда)
	
	Если (Объект.ВидКонтрагента.Пустая()) Тогда
		
		_УФК.ВывестиПредупреждение("Не указан вид контрагента!");
		Возврат;
		
	КонецЕсли; 
	Если (Объект.Контрагент.Пустая()) Тогда
		
		_УФК.ВывестиПредупреждение("Не указан контрагент!");
		Возврат;
		
	КонецЕсли; 
	Если (Объект.ТипПрайса.Пустая()) Тогда
		
		_УФК.ВывестиПредупреждение("Не указан тип прайса!");
		Возврат;
		
	КонецЕсли; 
	// --- 
	
	ИмяФормыРедактирования = _ИмяФормыРедактирования();
	Если ИмяФормыРедактирования <> Неопределено Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработатьИзменениеПрайса",ЭтотОбъект); 
		ПФ = Новый Структура("ТипПрайса,АдресПрайса,УИД, СтруктураОбъектаПрайса", Объект.ТипПрайса, АдресПрайса, ЭтаФорма.УникальныйИдентификатор, Объект);
		ОткрытьФорму(ИмяФормыРедактирования,ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПрайса(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		АдресПрайса = Ответ;
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ИмяФормыРедактирования()
	// --- 
	
	// подключаем обработку, вдруг ещё не подключена
	_ПО.ПодключитьОбработку(Объект.ТипПрайса.Обработка);
	Возврат(_ПО.ПолучитьПолноеИмяФормыПоТипу(Объект.ТипПрайса.Обработка,"ФормаРедактирования"));
	
	// --- 
КонецФункции

&НаСервере
Функция _СформироватьЗаголовок()
	
	ЗаголовокДокумента = "Прайс контрагента " +  
		 ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")
	;
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры
